sysbench/output/cacheline128/warmup.out
sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 1201.24 qps: 19225.62 (r/w/o: 16822.34/0.00/2403.28) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 1404.60 qps: 22477.88 (r/w/o: 19668.67/0.00/2809.21) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 1436.11 qps: 22973.12 (r/w/o: 20100.90/0.00/2872.21) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 1212.77 qps: 19405.45 (r/w/o: 16979.92/0.00/2425.53) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 1310.78 qps: 20972.11 (r/w/o: 18350.55/0.00/2621.56) lat (ms,95%): 4.41 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 1444.04 qps: 23106.18 (r/w/o: 20218.11/0.00/2888.07) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 1415.13 qps: 22639.63 (r/w/o: 19809.57/0.00/2830.05) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 1435.59 qps: 22972.62 (r/w/o: 20101.25/0.00/2871.38) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 1423.51 qps: 22775.29 (r/w/o: 19928.28/0.00/2847.01) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 1446.80 qps: 23147.53 (r/w/o: 20253.94/0.00/2893.59) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 1411.01 qps: 22578.10 (r/w/o: 19756.09/0.00/2822.01) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 1442.09 qps: 23070.30 (r/w/o: 20186.51/0.00/2883.79) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 4 tps: 1392.69 qps: 22284.45 (r/w/o: 19498.67/0.00/2785.78) lat (ms,95%): 4.03 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 1424.35 qps: 22787.06 (r/w/o: 19938.35/0.00/2848.71) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 4 tps: 1411.26 qps: 22582.90 (r/w/o: 19760.39/0.00/2822.51) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 1250.80 qps: 20015.88 (r/w/o: 17514.27/0.00/2501.61) lat (ms,95%): 5.00 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 4 tps: 1282.36 qps: 20513.83 (r/w/o: 17949.30/0.00/2564.53) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 1435.41 qps: 22964.37 (r/w/o: 20093.55/0.00/2870.82) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 4 tps: 1392.61 qps: 22288.75 (r/w/o: 19503.33/0.00/2785.42) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 1386.01 qps: 22175.70 (r/w/o: 19403.68/0.00/2772.01) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 4 tps: 1433.01 qps: 22922.91 (r/w/o: 20057.10/0.00/2865.81) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 1408.35 qps: 22537.97 (r/w/o: 19721.07/0.00/2816.90) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 4 tps: 1368.03 qps: 21886.89 (r/w/o: 19150.83/0.00/2736.06) lat (ms,95%): 4.03 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 1403.37 qps: 22453.17 (r/w/o: 19646.63/0.00/2806.55) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2322110
        write:                           0
        other:                           331730
        total:                           2653840
    transactions:                        165865 (1382.16 per sec.)
    queries:                             2653840 (22114.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1382.1582
    time elapsed:                        120.0044s
    total number of events:              165865

Latency (ms):
         min:                                    1.86
         avg:                                    2.89
         max:                                   54.28
         95th percentile:                        4.10
         sum:                               479598.90

Threads fairness:
    events (avg/stddev):           41466.2500/700.90
    execution time (avg/stddev):   119.8997/0.00